IDENTIFICATION DIVISION.
PROGRAM-ID. move.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 IN-GROUP.
   05 IN-STATUS  PIC X(5).
   05 IN-DATA1   PIC X(4).
   05 IN-DATA2   PIC 9(3).

01 OUT-GROUP.
   05 OUT-STATUS PIC X(5).
   05 OUT-DATA1  PIC X(4).
   05 OUT-DATA2  PIC 9(3).

PROCEDURE DIVISION.
    MOVE 'READY' TO IN-STATUS.
    MOVE 'TEST'  TO IN-DATA1.
    MOVE 123     TO IN-DATA2.

    MOVE SPACE   TO OUT-STATUS.
    MOVE ZERO    TO OUT-DATA2.

    MOVE IN-STATUS TO OUT-STATUS.
    MOVE IN-DATA1  TO OUT-DATA1.
    MOVE IN-DATA2  TO OUT-DATA2.

    DISPLAY 'OUT-STATUS: ' OUT-STATUS.
    DISPLAY 'OUT-DATA1 : ' OUT-DATA1.
    DISPLAY 'OUT-DATA2 : ' OUT-DATA2.

    STOP RUN.