IDENTIFICATION DIVISION.
PROGRAM-ID. PERFROM.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 USER-INPUT      PIC X(10).
01 IDX             PIC 9(02).
01 SINGLE-CHAR     PIC X(01).
01 IN-STATUS       PIC X(10) VALUE "STATUS-A".
01 OUT-STATUS      PIC X(10).
01 IN-DATA1        PIC X(10) VALUE "DATA-111".
01 OUT-DATA1       PIC X(10).
01 IN-DATA2        PIC X(10) VALUE "DATA-222".
01 OUT-DATA2       PIC X(10).

PROCEDURE DIVISION.
    DISPLAY "請輸入英文或數字 (10碼內):".
    ACCEPT USER-INPUT.

    DISPLAY "--- 拆解結果如下 ---".
    PERFORM 200-SPLIT-SHOW VARYING IDX FROM 1 BY 1 UNTIL IDX > 10.

    PERFORM 100-COPY-PROCESS THRU 100-EXIT.

    STOP RUN.

200-SPLIT-SHOW.
    MOVE USER-INPUT(IDX:1) TO SINGLE-CHAR.
    IF SINGLE-CHAR NOT = SPACE
       DISPLAY "第 " IDX " 位是: " SINGLE-CHAR
    END-IF.

100-COPY-PROCESS.
    MOVE IN-STATUS TO OUT-STATUS.
    MOVE IN-DATA1  TO OUT-DATA1.
    MOVE IN-DATA2  TO OUT-DATA2.

100-EXIT.
    EXIT.

END PROGRAM PERFROM.